app/controllers/clients_controller.rb

SELECT * FROM "client_perms" WHERE ("client_perms"."user_id" = 1)
SELECT * FROM "client_statuses"
---
  def index
    if current_client && is_eclient?     # external client logged in
      redirect_to :action => 'edit', :id => current_client.id
      return
    end
    user_role = current_user.role.name
    perms     = ClientPerm.find_all_by_user_id(current_user.id).map {|p| p.client_id}
    @status_array = ClientStatus.all.collect {|p| [p.name,p.id.to_s]}

SELECT * FROM "client_statuses" WHERE ("client_statuses"."name" = 'Active') LIMIT 1
---
  def new
    @client = Client.new
    @client.client_status = ClientStatus.find_by_name('Active')

SELECT * FROM "clients" WHERE ("clients"."id" = 1)
---
  def edit
    if is_eclient?    # client accessing this form
      # may or may not yet have a record, check and setup @client accordingly
      if current_user.client
        @client = Client.find(current_user.client_id)

SELECT * FROM "clients" WHERE ("clients"."id" = 0)
---
  def show
    @client = Client.find(params[:id])

INSERT INTO "clients" ("address1", "city", "comment", "contact_name", "address2", "zip", "created_at", "client_name", "updated_at", "mobile", "phone", "fax", "client_status_id", "permit", "state") VALUES('123 Main Street', 'Houston', '', 'Test Contact', '', '79409', '2010-08-12 22:09:20', 'Test Client', '2010-08-12 22:09:20', '', '111-222-3333', '', 1, NULL, 'TX')
---
  def create
    @client = Client.new(params[:client])
    if @client.save

SELECT * FROM "clients" WHERE ("clients"."id" = 1)
UPDATE "users" SET "updated_at" = '2010-08-09 01:43:39', "last_request_at" = '2010-08-09 01:43:39' WHERE "id" = 1
---
  def update
    @client = Client.find(params[:id])
    @client.user = current_user if is_eclient?
    if @client.update_attributes(params[:client])

SELECT * FROM "clients" WHERE ("clients"."id" = 21)
---
  def set_current_client
    @client = Client.find(params[:id])