app/controllers/users_controller.rb

SELECT * FROM "roles"
---
  def index
    @role_array = Role.all.collect {|r| [r.name,r.id.to_s]}

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def edit
    # only admins are going to access this under current assumptions
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def set_current_staff_user
    @current_staff_user = User.find(params[:id])

UPDATE "users" SET "updated_at" = '2010-08-14 14:07:00', "last_request_at" = '2010-08-14 14:07:00' WHERE "id" = 1
---
  def set_theme
    current_user.update_attribute(:theme, params[:id])